//=================================================================================
// # 6 Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
//==================================================================================

string? inputLineA = Console.ReadLine();

if (inputLineA != null)

    int inputNumberA = int.Parse(inputLineA);
         
        if (A % 2 == 0)
 
            {
 
                Console.Write("Введенное число является четным");            
 
            }
 
            else
 
            {
 
                Console.Write("Введенное число нечетное");
            }

         Console.WriteLine(outResult);

